Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff

    }

  # module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6086294523579080555" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756118109668229200" -> "1758708056990315000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-sendJobEmail"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:53",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "311079775920316972" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756118109201783000" -> "1758708057066030000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_libraries_layer:20" -> (known after apply)
      ~ code_sha256                 = "Bjd5AqnmA+neNduF9VqpOqodJYFCQ58j+/Wzmc7fC1Y=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-08-25T10:38:00.960+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_libraries_layer:20" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/c1ea35fc32b836bf6cfd8e216b6c6b83a6ebe82455f3530d930ca4a1c92585f4.zip" -> "builds/09988ea9fbb7539aace61f7b2e4deeb22dff16eab99b6ee6fa5a96d13d5d9738.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 172644 -> (known after apply)
      ~ version                     = "20" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::pgxflow-backend-layers-20250730052938336300000001/builds/c1ea35fc32b836bf6cfd8e216b6c6b83a6ebe82455f3530d930ca4a1c92585f4.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "9b780ab59f3319df6d0a2fb70f05ef80" -> (known after apply)
      ~ id                            = "pgxflow-backend-layers-20250730052938336300000001/builds/c1ea35fc32b836bf6cfd8e216b6c6b83a6ebe82455f3530d930ca4a1c92585f4.zip" -> (known after apply)
      ~ key                           = "builds/c1ea35fc32b836bf6cfd8e216b6c6b83a6ebe82455f3530d930ca4a1c92585f4.zip" -> "builds/09988ea9fbb7539aace61f7b2e4deeb22dff16eab99b6ee6fa5a96d13d5d9738.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/c1ea35fc32b836bf6cfd8e216b6c6b83a6ebe82455f3530d930ca4a1c92585f4.zip" -> "builds/09988ea9fbb7539aace61f7b2e4deeb22dff16eab99b6ee6fa5a96d13d5d9738.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/09988ea9fbb7539aace61f7b2e4deeb22dff16eab99b6ee6fa5a96d13d5d9738.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/09988ea9fbb7539aace61f7b2e4deeb22dff16eab99b6ee6fa5a96d13d5d9738.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6036271857684153449" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/c1ea35fc32b836bf6cfd8e216b6c6b83a6ebe82455f3530d930ca4a1c92585f4.zip" -> "builds/09988ea9fbb7539aace61f7b2e4deeb22dff16eab99b6ee6fa5a96d13d5d9738.zip"
          ~ "timestamp" = "1756118110763540000" -> "1758708061228585000"
        }
    }

  # module.pgxflow[0].module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:53" -> (known after apply)
      ~ code_sha256                 = "V/sj3siwFhPxL6sxjmN7kWgfNsG6z4Gm4b38+1J8gXQ=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-08-25T10:38:00.894+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer:53" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:557690600725:layer:pgxflow_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/b9b4375ec3cb66576893802d0ef38215c98cb1bff38819e091d08b1a9cf3bd38.zip" -> "builds/2b037e99edef3503f7dd4cd5f2c846681f8883a34f06607030d6226a5baa6d66.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 22793 -> (known after apply)
      ~ version                     = "53" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::pgxflow-backend-layers-20250730052938336300000001/builds/b9b4375ec3cb66576893802d0ef38215c98cb1bff38819e091d08b1a9cf3bd38.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "d12a1f783f005241da0ea200bfc4290b" -> (known after apply)
      ~ id                            = "pgxflow-backend-layers-20250730052938336300000001/builds/b9b4375ec3cb66576893802d0ef38215c98cb1bff38819e091d08b1a9cf3bd38.zip" -> (known after apply)
      ~ key                           = "builds/b9b4375ec3cb66576893802d0ef38215c98cb1bff38819e091d08b1a9cf3bd38.zip" -> "builds/2b037e99edef3503f7dd4cd5f2c846681f8883a34f06607030d6226a5baa6d66.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/b9b4375ec3cb66576893802d0ef38215c98cb1bff38819e091d08b1a9cf3bd38.zip" -> "builds/2b037e99edef3503f7dd4cd5f2c846681f8883a34f06607030d6226a5baa6d66.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/2b037e99edef3503f7dd4cd5f2c846681f8883a34f06607030d6226a5baa6d66.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/2b037e99edef3503f7dd4cd5f2c846681f8883a34f06607030d6226a5baa6d66.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3421779944522418275" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/b9b4375ec3cb66576893802d0ef38215c98cb1bff38819e091d08b1a9cf3bd38.zip" -> "builds/2b037e99edef3503f7dd4cd5f2c846681f8883a34f06607030d6226a5baa6d66.zip"
          ~ "timestamp" = "1756118109649979200" -> "1758708057319360000"
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "331262214c5eae6aaf8e89cce40c6e3d4aab635f"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:d7d2b8e9e7f54cc1ff5ba76c90d96f90f23d8ad9f8dddb10d9dbd05bc6558fdd" -> (known after apply)
        name                 = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:d7d2b8e9e7f54cc1ff5ba76c90d96f90f23d8ad9f8dddb10d9dbd05bc6558fdd" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "1f832a3a87cb1169e95237ac19fe343073240c60" -> "331262214c5eae6aaf8e89cce40c6e3d4aab635f"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/36f39dcec95f1f16bfd1e081132d0c85cea6da8c228fbc4f46b8facc92895f11.zip" -> "builds/0f4cb7de207eb5b7090dc068a007c631fb43de87fc2d93b36c607c54991a9a2b.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-08-25T10:38:12.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/0f4cb7de207eb5b7090dc068a007c631fb43de87fc2d93b36c607c54991a9a2b.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/0f4cb7de207eb5b7090dc068a007c631fb43de87fc2d93b36c607c54991a9a2b.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6076392955838234431" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/36f39dcec95f1f16bfd1e081132d0c85cea6da8c228fbc4f46b8facc92895f11.zip" -> "builds/0f4cb7de207eb5b7090dc068a007c631fb43de87fc2d93b36c607c54991a9a2b.zip"
          ~ "timestamp" = "1756118097825310000" -> "1758708047450582000"
        }
    }

  # module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-0"
        name        = "sbeacon-backend-dataPortal-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-users-quota",
                          - "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-users-info",
                          - "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-saved-queries",
                          - "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-projects",
                          - "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-project-users",
                          - "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-pricing-cache",
                          - "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-juptyer-notebooks",
                          - "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-clinical-variants",
                          - "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-clinical-annotations",
                          - "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                  - {
                      - Action   = "pricing:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-project-users/index/uid-index",
                          - "arn:aws:dynamodb:ap-southeast-3:557690600725:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
                        ]
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:557690600725:userpool/ap-southeast-3_PXRtWWUqW"
                    },
                  - {
                      - Action   = [
                          - "sagemaker:UpdateNotebookInstance",
                          - "sagemaker:StopNotebookInstance",
                          - "sagemaker:StartNotebookInstance",
                          - "sagemaker:ListNotebookInstances",
                          - "sagemaker:DescribeNotebookInstance",
                          - "sagemaker:DeleteNotebookInstance",
                          - "sagemaker:CreatePresignedNotebookInstanceUrl",
                          - "sagemaker:CreateNotebookInstance",
                          - "sagemaker:AddTags",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sagemaker:ap-southeast-3:557690600725:notebook-instance/*"
                    },
                  - {
                      - Action   = "sagemaker:ListNotebookInstances"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:iam::557690600725:role/sbeacon_backend_sagemaker_jupyter_instance_role"
                    },
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = [
                                  - "projects/*",
                                  - "private/*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal20250331043651003800000004"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata20250331043647056400000003/*",
                          - "arn:aws:s3:::gaspi-dataportal20250331043651003800000004/projects/*",
                        ]
                    },
                  - {
                      - Action   = "s3:DeleteObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250331043651003800000004/private/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250730052940583900000003"
                    },
                  - {
                      - Action   = "s3:DeleteObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250730052940583900000003/*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:557690600725:function:sbeacon-backend-submitDataset",
                          - "arn:aws:lambda:ap-southeast-3:557690600725:function:sbeacon-backend-indexer",
                          - "arn:aws:lambda:ap-southeast-3:557690600725:function:sbeacon-backend-generateReports",
                          - "arn:aws:lambda:ap-southeast-3:557690600725:function:sbeacon-backend-generateCohortVCfs",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/32447b58358bff6fbc065f77c695ec443b3a7975b7336c9d9b0fcfffc5dcfac0.zip" -> "builds/2868e687f339ac9b843d22a32afac9c2e4f82f587de99f23d14cd03a64b46432.zip"
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2025-08-25T10:38:34.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_CLI_UPLOAD_TABLE"              = "sbeacon-dataportal-cli-upload"
                # (53 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/dataPortal/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/dataPortal",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/2868e687f339ac9b843d22a32afac9c2e4f82f587de99f23d14cd03a64b46432.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/2868e687f339ac9b843d22a32afac9c2e4f82f587de99f23d14cd03a64b46432.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6305791612316385184" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/32447b58358bff6fbc065f77c695ec443b3a7975b7336c9d9b0fcfffc5dcfac0.zip" -> "builds/2868e687f339ac9b843d22a32afac9c2e4f82f587de99f23d14cd03a64b46432.zip"
          ~ "timestamp" = "1756118098159550000" -> "1758708046823273000"
        }
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:10",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_binaries_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3225311774242019674" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756118097884150000" -> "1758708047350535000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:10",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_binaries_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2060813105430193681" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756118098321213000" -> "1758708047015963000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateReports.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-generateReports:sbeacon-backend-generateReports-0"
        name        = "sbeacon-backend-generateReports-0"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = "s3:PutObject" -> [
                          + "s3:PutObject",
                          + "s3:GetObject",
                        ]
                      ~ Resource = "arn:aws:s3:::gaspi-dataportal20250331043651003800000004/projects/*/clinical-workflows/*/reports/*" -> "arn:aws:s3:::gaspi-dataportal20250331043651003800000004/*"
                        # (1 unchanged attribute hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/0300e75b7f536502cf4a1de5308dcfa7fc3b7756791a2ad0c7579e34a8fcf036.zip" -> "builds/52e411fd7f12ac5bd584f8e5ea491f5cf1fe84c292c993393ab51989d07a9f8a.zip"
        id                             = "sbeacon-backend-generateReports"
      ~ last_modified                  = "2025-08-18T03:17:02.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/generateReports/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/generateReports",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/52e411fd7f12ac5bd584f8e5ea491f5cf1fe84c292c993393ab51989d07a9f8a.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/52e411fd7f12ac5bd584f8e5ea491f5cf1fe84c292c993393ab51989d07a9f8a.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3105011606778155659" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/0300e75b7f536502cf4a1de5308dcfa7fc3b7756791a2ad0c7579e34a8fcf036.zip" -> "builds/52e411fd7f12ac5bd584f8e5ea491f5cf1fe84c292c993393ab51989d07a9f8a.zip"
          ~ "timestamp" = "1756118098060109000" -> "1758708047016446200"
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1722248096300419007" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756118097588875000" -> "1758708047933671000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5080401662383386837" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756118097484786000" -> "1758708047946268000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2010911274514721446" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756118098322210000" -> "1758708047356297000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/427c5e3d9e9fa39e760b49b617ec793658f3f92963ec6c3a47f9db9971deb518.zip" -> "builds/c0fabd6fdfa795c07507fcca460748248e866e415b601681a8411e730368147f.zip"
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2025-08-25T10:38:24.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getDatasets",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/c0fabd6fdfa795c07507fcca460748248e866e415b601681a8411e730368147f.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/c0fabd6fdfa795c07507fcca460748248e866e415b601681a8411e730368147f.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2919466285357690711" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/427c5e3d9e9fa39e760b49b617ec793658f3f92963ec6c3a47f9db9971deb518.zip" -> "builds/c0fabd6fdfa795c07507fcca460748248e866e415b601681a8411e730368147f.zip"
          ~ "timestamp" = "1756118098136617000" -> "1758708047638025000"
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5243161240351752449" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756118097927355000" -> "1758708047936255000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8809471850250268957" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756118097483224000" -> "1758708046966155000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4451254039164636429" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756118098469043000" -> "1758708047721761000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3238232625316441441" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756118098539057000" -> "1758708047523174000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4370068193291106977" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756118098575612000" -> "1758708047844421000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5671442942676677292" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756118098040735000" -> "1758708048021779000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1422239647322667847" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756118097423513800" -> "1758708047375758800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1090509659616084965" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756118097850007000" -> "1758708047254304800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6117308051812360532" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756118098426347000" -> "1758708047155899000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_binaries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5143526902081428669" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756118098352082000" -> "1758708046571185200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3642624360870886328" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756118097745806000" -> "1758708047840518000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "557690600725.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:d7d2b8e9e7f54cc1ff5ba76c90d96f90f23d8ad9f8dddb10d9dbd05bc6558fdd" -> (known after apply)
      ~ last_modified                  = "2025-08-25T10:37:58.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_binaries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:14",
          - "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3145002968538955" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1756118097760732000" -> "1758708047237974800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:14" -> (known after apply)
      ~ code_sha256                 = "zbgTz9rfaSjryzA8Rdg6bhIRxs0U0/bUPQ773nN3Ucc=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-08-25T10:38:03.333+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer:14" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/04ffbe237fd5000a0b28377e181e7561a03580f05ee285f1aeff6e0e57bb46a8.zip" -> "builds/3528a8cbd09c39fe987fbb114e91c79d74423e96aabf7bace06d225b5d2ca598.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 24398145 -> (known after apply)
      ~ version                     = "14" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers20250331043640018600000001/builds/04ffbe237fd5000a0b28377e181e7561a03580f05ee285f1aeff6e0e57bb46a8.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "81b8403966f7f34f9680b1b1ccd37b48-5" -> (known after apply)
      ~ id                            = "gaspi-lambda-layers20250331043640018600000001/builds/04ffbe237fd5000a0b28377e181e7561a03580f05ee285f1aeff6e0e57bb46a8.zip" -> (known after apply)
      ~ key                           = "builds/04ffbe237fd5000a0b28377e181e7561a03580f05ee285f1aeff6e0e57bb46a8.zip" -> "builds/3528a8cbd09c39fe987fbb114e91c79d74423e96aabf7bace06d225b5d2ca598.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/04ffbe237fd5000a0b28377e181e7561a03580f05ee285f1aeff6e0e57bb46a8.zip" -> "builds/3528a8cbd09c39fe987fbb114e91c79d74423e96aabf7bace06d225b5d2ca598.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/3528a8cbd09c39fe987fbb114e91c79d74423e96aabf7bace06d225b5d2ca598.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/3528a8cbd09c39fe987fbb114e91c79d74423e96aabf7bace06d225b5d2ca598.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "283319023208799579" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/04ffbe237fd5000a0b28377e181e7561a03580f05ee285f1aeff6e0e57bb46a8.zip" -> "builds/3528a8cbd09c39fe987fbb114e91c79d74423e96aabf7bace06d225b5d2ca598.zip"
          ~ "timestamp" = "1756118105661596000" -> "1758708054481652000"
        }
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:10" -> (known after apply)
      ~ code_sha256                 = "B5UPmI+/woJA9HEBpSK4PONYtbdR3whfR+ulMuFcOio=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-08-25T10:38:00.790+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer:10" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:557690600725:layer:sbeacon_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/8909f1df13d9fa2b0a523aead2a12d4328ad41766489ad9eb535aafa90639707.zip" -> "builds/56cc2fff6bf54652e9a60c31936c3f10374d574d0ba0261851857eb83e47bb8f.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 120511 -> (known after apply)
      ~ version                     = "10" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers20250331043640018600000001/builds/8909f1df13d9fa2b0a523aead2a12d4328ad41766489ad9eb535aafa90639707.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "d097072c3f978737c1e5114ca2ebb6e0" -> (known after apply)
      ~ id                            = "gaspi-lambda-layers20250331043640018600000001/builds/8909f1df13d9fa2b0a523aead2a12d4328ad41766489ad9eb535aafa90639707.zip" -> (known after apply)
      ~ key                           = "builds/8909f1df13d9fa2b0a523aead2a12d4328ad41766489ad9eb535aafa90639707.zip" -> "builds/56cc2fff6bf54652e9a60c31936c3f10374d574d0ba0261851857eb83e47bb8f.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/8909f1df13d9fa2b0a523aead2a12d4328ad41766489ad9eb535aafa90639707.zip" -> "builds/56cc2fff6bf54652e9a60c31936c3f10374d574d0ba0261851857eb83e47bb8f.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/56cc2fff6bf54652e9a60c31936c3f10374d574d0ba0261851857eb83e47bb8f.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/56cc2fff6bf54652e9a60c31936c3f10374d574d0ba0261851857eb83e47bb8f.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3017882691910506806" -> (known after apply)
  
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.